In [8]:
import pandas as pd 
import numpy as np
import os 
import random
import string

In [2]:
os.chdir('/Users/tomisin/Library/Docs/com~apple~CloudDocs/c.Documents/Mentorship_Program/SQL/CSV')

In [3]:
#Columns= customer_id, customer_name, email, phone

In [4]:
df = pd.DataFrame()

# Creating entries for customer_id

In [5]:
cust_id = []
i=10000
while i<10100:
    cust_id.append(i)
    i=i+1
print(cust_id)

[10000, 10001, 10002, 10003, 10004, 10005, 10006, 10007, 10008, 10009, 10010, 10011, 10012, 10013, 10014, 10015, 10016, 10017, 10018, 10019, 10020, 10021, 10022, 10023, 10024, 10025, 10026, 10027, 10028, 10029, 10030, 10031, 10032, 10033, 10034, 10035, 10036, 10037, 10038, 10039, 10040, 10041, 10042, 10043, 10044, 10045, 10046, 10047, 10048, 10049, 10050, 10051, 10052, 10053, 10054, 10055, 10056, 10057, 10058, 10059, 10060, 10061, 10062, 10063, 10064, 10065, 10066, 10067, 10068, 10069, 10070, 10071, 10072, 10073, 10074, 10075, 10076, 10077, 10078, 10079, 10080, 10081, 10082, 10083, 10084, 10085, 10086, 10087, 10088, 10089, 10090, 10091, 10092, 10093, 10094, 10095, 10096, 10097, 10098, 10099]

In [6]:
df['customer_id'] = cust_id

In [7]:
df

    customer_id
0         10000
1         10001
2         10002
3         10003
4         10004
..          ...
95        10095
96        10096
97        10097
98        10098
99        10099

[100 rows x 1 columns]

# Creating entries for customer_name

In [8]:
pip install names

Requirement already satisfied: names in /Users/tomisin/opt/anaconda3/lib/python3.9/site-packages (0.3.0)
Note: you may need to restart the kernel to use updated packages.

In [9]:
import names 
first_name = []
last_name = []

for i in range(0,100):
    first_name.append(names.get_first_name())
    last_name.append(names.get_last_name())

In [10]:
df['first_name']= first_name
df['last_name']= last_name

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  100 non-null    int64
 1   first_name   100 non-null    object
 2   last_name    100 non-null    object
dtypes: int64(1), object(2)
memory usage: 2.5+ KB

In [12]:
df

    customer_id first_name last_name
0         10000     Esther   Ballard
1         10001    Carlton  Schaefer
2         10002     Kelley   Hubbard
3         10003    Dorothy    Groves
4         10004    Yolanda     Combs
..          ...        ...       ...
95        10095      Nancy    Dunkan
96        10096    Michael    Kannel
97        10097   Margaret    Nelson
98        10098      Helen   Barrios
99        10099   Sharlene    Butter

[100 rows x 3 columns]

# Creating entries for email

In [13]:
cust_email = []

for i in range(len(df)):
    a = df.loc[i, "first_name"]+df.loc[i, "last_name"]+'@gmail.com'
    cust_email.append(a)

In [14]:
df['email']=cust_email

In [15]:
df

    customer_id first_name last_name                      email
0         10000     Esther   Ballard    EstherBallard@gmail.com
1         10001    Carlton  Schaefer  CarltonSchaefer@gmail.com
2         10002     Kelley   Hubbard    KelleyHubbard@gmail.com
3         10003    Dorothy    Groves    DorothyGroves@gmail.com
4         10004    Yolanda     Combs     YolandaCombs@gmail.com
..          ...        ...       ...                        ...
95        10095      Nancy    Dunkan      NancyDunkan@gmail.com
96        10096    Michael    Kannel    MichaelKannel@gmail.com
97        10097   Margaret    Nelson   MargaretNelson@gmail.com
98        10098      Helen   Barrios     HelenBarrios@gmail.com
99        10099   Sharlene    Butter   SharleneButter@gmail.com

[100 rows x 4 columns]

# Creating entries for phone number

In [16]:
cust_no = []
phone_no =random.randint(10000000000,90000000000)
phone_no

74228048809

In [17]:
import random


def random_number():
    number = list(
        str(random.randint(11111111111, 99999999999))
    )  # 11 random digits to str
    number[0] = '0'  # start with 0
    number[1] = '1'  # second number must be 1
    number[2] = str(random.choice([2, 3, 5]))  # third number can be 2, 3, or 5

    return ''.join(number)

In [18]:
cust_no = []

for i in range(0, 100):
    a = random_number()
    cust_no.append(a)

In [19]:
df['phone_number']= cust_no

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   100 non-null    int64
 1   first_name    100 non-null    object
 2   last_name     100 non-null    object
 3   email         100 non-null    object
 4   phone_number  100 non-null    object
dtypes: int64(1), object(4)
memory usage: 4.0+ KB

In [21]:
df

    customer_id first_name last_name                      email phone_number
0         10000     Esther   Ballard    EstherBallard@gmail.com  01387806160
1         10001    Carlton  Schaefer  CarltonSchaefer@gmail.com  01520724648
2         10002     Kelley   Hubbard    KelleyHubbard@gmail.com  01339466781
3         10003    Dorothy    Groves    DorothyGroves@gmail.com  01235518963
4         10004    Yolanda     Combs     YolandaCombs@gmail.com  01345078935
..          ...        ...       ...                        ...          ...
95        10095      Nancy    Dunkan      NancyDunkan@gmail.com  01256460332
96        10096    Michael    Kannel    MichaelKannel@gmail.com  01264912444
97        10097   Margaret    Nelson   MargaretNelson@gmail.com  01268356351
98        10098      Helen   Barrios     HelenBarrios@gmail.com  01360435336
99        10099   Sharlene    Butter   SharleneButter@gmail.com  01298757716

[100 rows x 5 columns]

In [22]:
name = []

for i in range(len(df)):
    names = df.loc[i, "first_name"] + ' ' + df.loc[i, "last_name"]
    name.append(names)

In [23]:
df.drop(['first_name', 'last_name'], axis=1, inplace=True)

In [24]:
df['name'] = name

In [25]:
df = df[list(('customer_id', 'name', 'email', 'phone_number'))]

In [26]:
df.to_csv('Customer_table.csv')

# Create POSTGRESQL database connection

In [48]:
import psycopg2

conn = psycopg2.connect(database = 'exercise1',
                        host="localhost",
                        user="postgres",
                        password='postgres',
                        port="5433")
conn.autocommit = True
print(conn)

<connection object at 0x7f87c371feb0; dsn: 'user=postgres password=xxx dbname=exercise1 host=localhost port=5433', closed: 0>

In [49]:
cur = conn.cursor()

In [41]:
query = 'create database Exercise1;'

In [42]:
cur.execute(query)

DuplicateDatabase: database "exercise1" already exists

# Export 'customer' table into SQL

In [50]:
df = pd.read_csv('/Users/tomisin/Library/docs/com~apple~CloudDocs/c.Documents/Mentorship_Program/SQL/Exercise1/CSV/Customer_table.csv', sep=';')

In [51]:
df.head()

   customer_id             name                     email  phone_number
0        10000  Sherri Seabaugh  SherriSeabaugh@gmail.com    1219221225
1        10001      Penny Craig      PennyCraig@gmail.com    1281215034
2        10002   Patricia South   PatriciaSouth@gmail.com    1384225155
3        10003      Jessie Cook      JessieCook@gmail.com    1293912251
4        10004     Maria Spivey     MariaSpivey@gmail.com    1350891156

In [52]:
query= 'CREATE TABLE customer (customer_id INT PRIMARY KEY,customer_name VARCHAR (255) not null,email VARCHAR (255) not null,phone VARCHAR (20) not null)'

In [53]:
cur.execute(query)

In [ ]:
pip install python-dotenv

In [ ]:
from dotenv import load_dotenv

In [54]:
rows = df.values
counter = 0
for row in rows:
    row = tuple(row)
    if counter==0:
        print(row)
    counter+=1

(10000, 'Sherri Seabaugh', 'SherriSeabaugh@gmail.com', 1219221225)

In [55]:
rows = df.values
counter = 0
for row in rows:
    row = tuple(row)
    query = f"insert into customer values{row}"
    cur.execute(query)
conn.commit()

# Export 'product' table into SQL

In [56]:
df1 = pd.read_csv('/Users/tomisin/Library/docs/com~apple~CloudDocs/c.Documents/Mentorship_Program/SQL/Exercise1/CSV/product_table.csv', sep=',')

In [57]:
df1.head(20)

    product_id     product_name       description product_category  unit_price
0         2001        Man shirt           stripes      Summer wear       35.00
1         2002      Woman Skirt       pencil type      Summer wear       45.99
2         2003      Wrist watch             chain      Assessories      120.00
3         2004    Winter jacket               fur      Winter wear       50.30
4         2005          sneaker            sporty        Foot wear       70.00
5         2006            Boots           leather        Foot wear      150.00
6         2007        Face caps            cotton             Caps       70.00
7         2008             Hats  Cotten synthetic             Caps       50.00
8         2009         Singlets           spandex        Underwear       10.00
9         2010           Boxers            cotton        Underwear        8.00
10        2011        Men pants          polyster      Casual wear       38.99
11        2012          Glasses            rubber      Accessories       80.00
12        2013         G-string             satin        Underwear       27.50
13        2014              Bra              lace      Sports wear       30.00
14        2015   Women lingerie            spanet        Underwear       75.00
15        2016     Biker shorts           spandex      Sports wear       65.00
16        2017      Sweat pants     cotton fleece      Casual wear       59.00
17        2018         Pullover              wool      Casual wear       60.00
18        2019    Jeans trouser     strong cotten      Casual wear      115.00
19        2020      Travel bags   ballistic nylon          Luggage      350.00

In [58]:
query1 = 'CREATE TABLE product (product_id INT PRIMARY KEY,product_name VARCHAR (255) not null,description TEXT,product_category VARCHAR (50) not null,unit_price DECIMAL (10,2) not null);'

In [59]:
cur.execute(query1)

In [60]:
rows = df1.values
counter = 0
for row in rows:
    row = tuple(row)
    if counter==0:
        print(row)
    counter+=1

(2001, 'Man shirt', 'stripes', 'Summer wear', 35.0)

In [61]:
rows = df1.values
counter = 0
for row in rows:
    row = tuple(row)
    query = f"insert into product values{row}"
    cur.execute(query)
conn.commit()

# Export 'orders' table into SQL

In [62]:
df2 = pd.read_csv('/Users/tomisin/Library/docs/com~apple~CloudDocs/c.Documents/Mentorship_Program/SQL/Exercise1/CSV/order_table.csv', sep=',')

In [63]:
df2.head()

   order_id  customer_id  order_date  product_id  quantity delivery_status
0      3001        10000  2004-01-01        2050         1         Shipped
1      3002        10001  2004-01-24        2034        10      Processing
2      3003        10002  2004-02-16        2041        14       Delivered
3      3004        10003  2004-03-10        2020        13         Shipped
4      3005        10004  2004-04-02        2005        19      Processing

In [64]:
query2 = 'CREATE TABLE orders (order_id INT PRIMARY KEY,customer_id INT,order_date DATE not null,product_id INT,quantity INT not null,delivery_status VARCHAR(20),FOREIGN KEY (customer_id) REFERENCES customer(customer_id),FOREIGN KEY (product_id) REFERENCES product(product_id));'

In [65]:
cur.execute(query2)

In [66]:
rows = df2.values
counter = 0
for row in rows:
    row = tuple(row)
    if counter==0:
        print(row)
    counter+=1

(3001, 10000, '2004-01-01', 2050, 1, 'Shipped')

In [67]:
rows = df2.values
counter = 0
for row in rows:
    row = tuple(row)
    query = f"insert into orders values{row}"
    cur.execute(query)
conn.commit()

# Export 'payment' table into SQL

In [68]:
df3 = pd.read_csv('/Users/tomisin/Library/docs/com~apple~CloudDocs/c.Documents/Mentorship_Program/SQL/Exercise1/CSV/payment_table.csv')

In [69]:
df3.head()

   payment_id  order_id payment_date
0        4001      3001   2004-01-01
1        4002      3002   2004-01-24
2        4003      3003   2004-02-16
3        4004      3004   2004-03-10
4        4005      3005   2004-04-02

In [70]:
query3= 'CREATE TABLE payment (payment_id INT PRIMARY KEY,order_id INT,payment_date DATE not null,FOREIGN KEY (order_id) REFERENCES orders (order_id));'

In [71]:
cur.execute(query3)

In [72]:
rows = df3.values
counter = 0
for row in rows:
    row = tuple(row)
    if counter==0:
        print(row)
    counter+=1

(4001, 3001, '2004-01-01')

In [73]:
rows = df3.values
counter = 0
for row in rows:
    row = tuple(row)
    query = f"insert into payment values{row}"
    cur.execute(query)
conn.commit()

# Export 'credit_card' table into SQL

In [74]:
df4=pd.read_excel('/Users/tomisin/Library/docs/com~apple~CloudDocs/c.Documents/Mentorship_Program/SQL/Exercise1/CSV/credit_card.xlsx')

In [81]:
df4.head()

   card_id  customer_id   card_number card_expiry_date         bank_name
0        1        10000  123456789123          2025-01            Zenith
1        2        10001  125757625825          2025-02            Access
2        3        10002  128058462527          2025-03            Zenith
3        4        10003  130359299229          2025-04  Guaranteed Trust
4        5        10004  132660135931          2025-05  Guaranteed Trust

In [82]:
rows = df4.values
counter = 0
for row in rows:
    row = tuple(row)
    if counter==0:
        print(row)
    counter+=1

(1, 10000, 123456789123, '2025-01', 'Zenith')

In [86]:
rows = df4.values
counter = 0
for row in rows:
    row = tuple(row)
    query = f"insert into credit_card values{row}"
    cur.execute(query)
conn.commit()